<template>
  <Navbar />
   <section class="projects">
        <h1 class="heading"> <span>{{name}}</span> </h1>
        <h3>{{Synopsis_name}}</h3>
        <br>
        <p>{{Synopsis_detail}}</p>
        <p>{{Synopsis_detail1}}</p>
        <div class="box-container">
        </div>
    </section>
</template>

<script>
import Navbar from '../components/Navbar.vue'
export default {
  components: { Navbar },
  data() {
    return {
      name: 'Synopsis',
      Synopsis_name: 'เรื่องย่อ',
      Synopsis_detail: 'ในเรื่อง One Piece พูดถึงยุคทองของโจรสลัดเมื่อเจ้าแห่งโจรสลัด โกลด์ ดี โรเจอร์ ถูกประหาร มหาสมบัติ”วันพีซ”ในตำนานก็ไร้เจ้าของ ทำให้โจรสลัดทั่วโลกต่างพากันกางธงเข้าแย่งชิงมหาสมบัตินี้ มังกี้ ดี ลูฟี่ ผู้ซึ่งวัยเด็กได้มีโอกาสรู้จักกับหนึ่งในโจรสลัดผู้ยิ่งใหญ่ แชงคูส และฝันเป็นเจ้าแห่งโจรสลัด ลูฟี่ได้กินผลปีศาจ ผลโกมุโกมุ ผลไม้ปีศาจที่พวกแชงคูสเก็บมาได้เข้าไปเลยกลายมาเป็นมนุษย์ยางยืดแถมว่ายน้ำไม่ได้ตลอดชีวิต 10 ปีต่อมาลูฟี่ก็เติบโตขึ้น และพร้อมที่จะออกทะเลเพื่อทำความฝันให้เป็นจริง ลูฟี่ต้องออกเรือไปยังทะเลกว้างใหญ่ไพศาลเข้าไปยัง ‘แกรนด์ไลน์’ ทะเลที่ใหญ่ที่สุดในโลกซึ่งตั้งอยู่ตรงเส้นศูนย์สูตร แล้วออกเดินเรือผจญภัยไปรอบโลกเพื่อที่จะไปถึงเกาะสุดท้าย รัฟเทล ที่ว่ากันว่าสมบัติวันพีซถูกเก็บไว้ที่นั่น',
      Synopsis_detail1: 'ลูฟี่ได้เริ่มต้นการผจญภัยออกเรือเดินทางไปทะเลแกรนด์ไลน์ ระหว่างทางลูฟี่ต้องเจอศัตรูที่ร้ายกาจและผู้ใช้พลังของผลปีศาจมากมาย แต่เขาก็ได้สหายร่วมเป็นร่วมตายมาเป็นพวกพ้องได้แก่ โรโรโนอา โซโล นามิ อุซป ซันจิ โทนี่ โทนี่ ช็อปเปอร์ นิโค โรบิน พวกลูฟี่ได้แล่นเรือจากอิสท์บลูเข้ามาในแกรนด์ไลน์และใช้ล็อกโพส ล็อกเส้นทางเดินเรือผ่าน วิสกี้พีค ลิตเติ้ล การ์เด้น อาณาจักรดรัม อาณาจักรทะลทรายอลาบาสต้า จายา เกาะแห่งท้องฟ้าสกายเปีย ลองริง ลองแลนด์ จนได้เดินทางมาถึง วอเตอร์เซเว่น เกาะที่มีชื่อเสียงด้านการต่อเรือ เพื่อซ่อมเรือโกอิ้งแมรี่ แต่เรือโกอิ้งแมรี่ ก็เสียหายหนักจนซ่อมไม่ได้ เป็นเหตุให้อุซปมีปัญหากับลูฟี่อย่างรุนแรง อีกทั้งนิโค โรบินยังยอมถูกจับตัวไปยังเอนิเอสล็อบบี้เพื่อแลกกับการที่พวกลูฟี่ไม่ต้องเจอกับบัสเตอร์คอล หลังจากช่วยนิโค โรบินสำเร็จพวกลูฟี่ได้เรือลำใหม่เธาซันด์ซันนี่และช่างต่อเรือแฟรงกี้ จากนั้นจึงเดินทางไปยังเกาะเงือกแต่เรือก็หลงเข้ามาในทะเลหมอกที่มีชื่อว่าฟลอเรี่ยน ไทรแองเกิ้ล จนต้องเจอกับหนึ่งในเจ็ดเทพโจรสลัด เก็กโค โมเรีย ในทริลเลอร์พาร์คซึ่งเป็นเรือของโมเรีย ลูฟี่สามารถล้มออซอสูรกายยักษ์ที่ใส่เงาของลูฟี่ และโมเรียลงได้แต่ก็ต้องมาเจอ บาโซโลมิว คุมะ เจ็ดเทพโจรสลัดอีกคนแต่ด้วยความกล้าหาญและเสียสละของโซโล ซึ่งรับการโจมตีของคุมะแทนลูฟี่เพียงคนเดียวพวกลูฟี่จึงผ่านพ้นอันตรายมาอีกครั้งและได้ บรู๊ค มาเป็นพวกพ้องอีกคน หลังจากนั้นกลุ่มโจรสลัดหมวกฟางจึงได้ออกเดินทาง การผจญภัยครั้งยิ่งใหญ่กำลังรอพวกเค้าอยู่!!!'
    }
  }

}
</script>

<style>

</style>